In [1]:
import pandas as pd 
import numpy as np

import warnings
warnings.filterwarnings('ignore')

In [2]:
df = pd.read_csv("population_by_education_level.csv")

In [3]:
df.head()

  unit sex     age isced11 geography  date  value
0  THS   F  Y15-19   ED0-2        AT  2020  149.8
1  THS   F  Y15-19   ED0-2        BE  2020  247.9
2  THS   F  Y15-19   ED0-2        BG  2020  128.4
3  THS   F  Y15-19   ED0-2        CH  2020  168.2
4  THS   F  Y15-19   ED0-2        CY  2020   16.8

In [4]:
df.tail()

       unit sex     age isced11 geography  date   value
609971  THS   T  Y65-69   TOTAL        SE  1983     NaN
609972  THS   T  Y65-69   TOTAL        SI  1983     NaN
609973  THS   T  Y65-69   TOTAL        SK  1983     NaN
609974  THS   T  Y65-69   TOTAL        TR  1983     NaN
609975  THS   T  Y65-69   TOTAL        UK  1983  2532.5

In [5]:
df.shape

(609976, 7)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 609976 entries, 0 to 609975
Data columns (total 7 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   unit       609976 non-null  object
 1   sex        609976 non-null  object
 2   age        609976 non-null  object
 3   isced11    609976 non-null  object
 4   geography  609976 non-null  object
 5   date       609976 non-null  int64
 6   value      361370 non-null  float64
dtypes: float64(1), int64(1), object(5)
memory usage: 32.6+ MB

In [7]:
df.describe()

                date          value
count  609976.000000  361370.000000
mean     2001.500000    4437.056919
std        10.965865   16716.155159
min      1983.000000       0.400000
25%      1992.000000      84.500000
50%      2001.500000     400.050000
75%      2011.000000    1947.575000
max      2020.000000  380593.300000

In [8]:
df.isnull().sum()

unit              0
sex               0
age               0
isced11           0
geography         0
date              0
value        248606
dtype: int64

## Exploração Inicial dos Dados

Existem muitos dados "T" na variavel sexo, que representa a soma dos dados de ambos os sexos (M + F). Essa é a explicação mais comum em bases do Eurostat.

In [9]:
df['sex'].value_counts()

sex
T    203680
M    203376
F    202920
Name: count, dtype: int64

Existem valores "TOTAL" na variavel isced11, representando a soma dos dados total das faixas de Educacionais segunda a International Standard Classification of Education (ISCED11)
Os valores "NRP" representam "No Response Provided", Isso indica que, para aquele registro, não houve uma resposta válida sobre o nível educacional. Pode ser um dado faltante.

In [10]:
df['isced11'].value_counts()

isced11
ED0-2    128934
ED3_4    128934
TOTAL    128934
ED5-8    128402
NRP       94772
Name: count, dtype: int64

Existem valores 'EU15', 'EA19', 'EU27_2020', 'EU28' que representam dados agregados de paises dentro União Europeia ou da Zona do Euro

In [11]:
df['geography'].value_counts()

geography
IE           16530
EU28         16530
SI           16530
SE           16530
PT           16530
NO           16530
NL           16530
LU           16530
IT           16530
IS           16530
BE           16530
HU           16530
FR           16530
FI           16530
UK           16530
EU27_2020    16530
EU15         16530
CH           16530
ES           16530
EL           16530
CZ           16530
EA19         16530
DE           16530
DK           16530
LV           16492
AT           16340
EE           16112
HR           15960
MT           14896
LT           13908
TR           13680
RO           13642
MK           13224
CY           13224
BG           13224
SK           13224
ME           13110
PL           13110
RS           13110
Name: count, dtype: int64

### Dados "T" de sexo são apagados

In [12]:
df = df[df['sex'] != 'T']
print(df['sex'].unique())

['F' 'M']

### Dados "TOTAL" de isced11 são apagados

In [13]:
df = df[df['isced11'] != 'TOTAL']
print(df['isced11'].unique())

['ED0-2' 'ED3_4' 'ED5-8' 'NRP']

### Os valores agregados da União Européia e zona do Euro são apagados

In [14]:
df = df[~df['geography'].isin(['EU15', 'EA19', 'EU27_2020', 'EU28'])]
print(df['geography'].unique())

['AT' 'BE' 'BG' 'CH' 'CY' 'CZ' 'DE' 'DK' 'EE' 'EL' 'ES' 'FI' 'FR' 'HR'
 'HU' 'IE' 'IS' 'IT' 'LT' 'LU' 'LV' 'ME' 'MK' 'MT' 'NL' 'NO' 'PL' 'PT'
 'RO' 'RS' 'SE' 'SI' 'SK' 'TR' 'UK']

### Apaga todos os registros NaN de Value

In [15]:
df = df.dropna(subset=['value'])

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 160846 entries, 0 to 604576
Data columns (total 7 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   unit       160846 non-null  object
 1   sex        160846 non-null  object
 2   age        160846 non-null  object
 3   isced11    160846 non-null  object
 4   geography  160846 non-null  object
 5   date       160846 non-null  int64
 6   value      160846 non-null  float64
dtypes: float64(1), int64(1), object(5)
memory usage: 9.8+ MB

In [17]:
df['age'].value_counts()

age
Y15-74    5815
Y15-64    5798
Y15-59    5794
Y15-39    5755
Y25-74    5728
Y20-64    5718
Y25-64    5700
Y25-59    5694
Y25-54    5687
Y25-49    5671
Y40-64    5657
Y50-74    5650
Y40-59    5646
Y25-39    5636
Y15-24    5614
Y50-64    5603
Y50-59    5569
Y55-64    5552
Y25-29    5516
Y30-34    5492
Y35-39    5480
Y50-54    5472
Y40-44    5462
Y45-49    5462
Y20-24    5456
Y55-59    5421
Y60-64    5366
Y65-69    5342
Y15-19    4090
Name: count, dtype: int64

In [18]:
df['date'].value_counts()

date
2013    6549
2015    6526
2017    6523
2018    6517
2016    6517
2014    6507
2012    6503
2011    6497
2019    6471
2010    6338
2020    6222
2009    6077
2008    6056
2007    5978
2006    5964
2002    5718
2000    5621
2005    5615
2003    5565
2004    5564
2001    5557
1999    5348
1998    4337
1997    4140
1996    3437
1995    2747
1993    2115
1994    2077
1992    1960
1988     696
1987     696
1991     696
1989     696
1990     696
1986     638
1985     580
1983     580
1984     522
Name: count, dtype: int64

## Pré-processamento e Implementação dos Algoritmos
Antes de aplicar os algoritmos, é essencial padronizar os dados

In [19]:
from sklearn.preprocessing import StandardScaler

scaler = StandardScaler()

X = df[['value']]
X_scaled = scaler.fit_transform(X)

### K-Means

In [20]:
from sklearn.cluster import KMeans
from sklearn.metrics import silhouette_score, davies_bouldin_score

kmeans = KMeans(n_clusters=4, random_state=42)
kmeans_labels = kmeans.fit_predict(X_scaled)

silhouette_kmeans = silhouette_score(X_scaled, kmeans_labels)
davies_kmeans = davies_bouldin_score(X_scaled, kmeans_labels)

print(f"K-Means - Silhouette Score: {silhouette_kmeans:.3f}")
print(f"K-Means - Davies-Bouldin Index: {davies_kmeans:.3f}")

K-Means - Silhouette Score: 0.787
K-Means - Davies-Bouldin Index: 0.466

### DBSCAN

In [26]:
from sklearn.cluster import DBSCAN

df_sample = df.sample(n=10000, random_state=42)
X_sample = scaler.fit_transform(df_sample[['value']])

dbscan = DBSCAN(eps=1.5, min_samples=5, algorithm='ball_tree')
dbscan_labels = dbscan.fit_predict(X_sample)

# Remover outliers (-1) antes de calcular os scores
filtered_data = X_sample[dbscan_labels != -1]
filtered_labels = dbscan_labels[dbscan_labels != -1]

if len(set(filtered_labels)) > 1:
    silhouette_dbscan = silhouette_score(filtered_data, filtered_labels)
    davies_dbscan = davies_bouldin_score(filtered_data, filtered_labels)
else:
    silhouette_dbscan = "N/A"
    davies_dbscan = "N/A"

print(f"DBSCAN - Silhouette Score: {silhouette_dbscan}")
print(f"DBSCAN - Davies-Bouldin Index: {davies_dbscan}")

DBSCAN - Silhouette Score: N/A
DBSCAN - Davies-Bouldin Index: N/A